# Data Manipulation

In [ ]:
# Read .csv File.
# Fetch First Five Rows-> .head()
# Fetch last Five Rows-> .tail()
# Entire Dataset Information-> .describe()
# Check Entire Datatype-> .dtypes
# Handling Missing Values-> .isnull()
# Handling Missing Values, according to column-> .null().any(axis = 1(Rows)/0(Column))
# Check sum of missing values-> .isnull().sum()

#### Filling Missing Values

In [15]:
# Import numpy and Pandas
# Import .csv dataset

import numpy as np
import pandas as pd

#df = pd.read_csv("customers-100.csv")
df = pd.read_csv("Irish_all_number.csv")

# Check if any value is null
# Way-1st
df.isnull()
# Way-2nd
df.isnull().any(axis=0)
# Way-3rd
df.isnull().sum()

5.1    0
3.5    0
1.4    0
0.2    0
0      0
dtype: int64

In [14]:
# Fill missing values with zero
df.fillna(0)

     5.1  3.5  1.4  0.2  0
0    4.9  3.0  1.4  0.2  0
1    4.7  3.2  1.3  0.2  0
2    4.6  3.1  1.5  0.2  0
3    5.0  3.6  1.4  0.2  0
4    5.4  3.9  1.7  0.4  0
..   ...  ...  ...  ... ..
144  6.7  3.0  5.2  2.3  2
145  6.3  2.5  5.0  1.9  2
146  6.5  3.0  5.2  2.0  2
147  6.2  3.4  5.4  2.3  2
148  5.9  3.0  5.1  1.8  2

[149 rows x 5 columns]

In [26]:
# Adding column
df['Salary'] = None
df

     5.1  3.5  1.4  0.2  0 Salary  Salary_fillNa
0    4.9  3.0  1.4  0.2  0   None            4.9
1    4.7  3.2  1.3  0.2  0   None            4.7
2    4.6  3.1  1.5  0.2  0   None            4.6
3    5.0  3.6  1.4  0.2  0   None            5.0
4    5.4  3.9  1.7  0.4  0   None            5.4
..   ...  ...  ...  ... ..    ...            ...
144  6.7  3.0  5.2  2.3  2   None            6.7
145  6.3  2.5  5.0  1.9  2   None            6.3
146  6.5  3.0  5.2  2.0  2   None            6.5
147  6.2  3.4  5.4  2.3  2   None            6.2
148  5.9  3.0  5.1  1.8  2   None            5.9

[149 rows x 7 columns]

In [27]:
# Filling missing values with the mean of the column

df.fillna(199)
df['Salary_fillNa'] = df['5.1'].fillna(df['5.1'].mean())
df

C:\Users\adity\AppData\Local\Temp\ipykernel_24800\297938120.py:3: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(199)

     5.1  3.5  1.4  0.2  0 Salary  Salary_fillNa
0    4.9  3.0  1.4  0.2  0   None            4.9
1    4.7  3.2  1.3  0.2  0   None            4.7
2    4.6  3.1  1.5  0.2  0   None            4.6
3    5.0  3.6  1.4  0.2  0   None            5.0
4    5.4  3.9  1.7  0.4  0   None            5.4
..   ...  ...  ...  ... ..    ...            ...
144  6.7  3.0  5.2  2.3  2   None            6.7
145  6.3  2.5  5.0  1.9  2   None            6.3
146  6.5  3.0  5.2  2.0  2   None            6.5
147  6.2  3.4  5.4  2.3  2   None            6.2
148  5.9  3.0  5.1  1.8  2   None            5.9

[149 rows x 7 columns]

In [28]:
df.dtypes

5.1              float64
3.5              float64
1.4              float64
0.2              float64
0                  int64
Salary            object
Salary_fillNa    float64
dtype: object

In [52]:
## Renaming Column
df['Date']= None
df = df.rename(columns={'Date': 'Sale Date'})
df= df.drop('Sale Date',axis=1)
df

     5.1  3.5  1.4  0.2  0 Salary  Salary_fillNa Sales Date
0    4.9  3.0  1.4  0.2  0   None            4.9       None
1    4.7  3.2  1.3  0.2  0   None            4.7       None
2    4.6  3.1  1.5  0.2  0   None            4.6       None
3    5.0  3.6  1.4  0.2  0   None            5.0       None
4    5.4  3.9  1.7  0.4  0   None            5.4       None
..   ...  ...  ...  ... ..    ...            ...        ...
144  6.7  3.0  5.2  2.3  2   None            6.7       None
145  6.3  2.5  5.0  1.9  2   None            6.3       None
146  6.5  3.0  5.2  2.0  2   None            6.5       None
147  6.2  3.4  5.4  2.3  2   None            6.2       None
148  5.9  3.0  5.1  1.8  2   None            5.9       None

[149 rows x 8 columns]

In [58]:
## Change datatype
df['Value_new'] = df['0.2'].astype(int)
### Also have missing value so you have to use fillna
df['Value_new'] = df['0.2'].fillna(df['0.2'].mean()).astype(int)
df

     5.1  3.5  1.4  0.2  0 Salary  Salary_fillNa Sales Date  Value_new
0    4.9  3.0  1.4  0.2  0   None            4.9       None          0
1    4.7  3.2  1.3  0.2  0   None            4.7       None          0
2    4.6  3.1  1.5  0.2  0   None            4.6       None          0
3    5.0  3.6  1.4  0.2  0   None            5.0       None          0
4    5.4  3.9  1.7  0.4  0   None            5.4       None          0
..   ...  ...  ...  ... ..    ...            ...        ...        ...
144  6.7  3.0  5.2  2.3  2   None            6.7       None          2
145  6.3  2.5  5.0  1.9  2   None            6.3       None          1
146  6.5  3.0  5.2  2.0  2   None            6.5       None          2
147  6.2  3.4  5.4  2.3  2   None            6.2       None          2
148  5.9  3.0  5.1  1.8  2   None            5.9       None          1

[149 rows x 9 columns]

In [ ]:
## Renaming "0.2" as Original ValueError
df.rename(columns={'0.2': "Original_Value"})

,5.1,3.5,1.4,Original_Value,0,Salary,Salary_fillNa,Sales Date,Value_new
0,4.9,3.0,1.4,0.2,0,None,4.9,None,0
1,4.7,3.2,1.3,0.2,0,None,4.7,None,0
2,4.6,3.1,1.5,0.2,0,None,4.6,None,0
3,5.0,3.6,1.4,0.2,0,None,5.0,None,0
4,5.4,3.9,1.7,0.4,0,None,5.4,None,0
...,...,...,...,...,...,...,...,...,...
144,6.7,3.0,5.2,2.3,2,None,6.7,None,2
145,6.3,2.5,5.0,1.9,2,None,6.3,None,1
146,6.5,3.0,5.2,2.0,2,None,6.5,None,2
147,6.2,3.4,5.4,2.3,2,None,6.2,None,2
148,5.9,3.0,5.1,1.8,2,None,5.9,None,1

In [ ]:
# Apply function to one of the columns.
# Using lamda function.
df['New_Value'] = df['3.5'].apply(lambda x:x**2)
df.head()

     5.1  3.5  1.4  0.2 Salary  Salary_fillNa Sales Date  Value_new  New_Value
0    4.9  3.0  1.4  0.2   None            4.9       None          0       9.00
1    4.7  3.2  1.3  0.2   None            4.7       None          0      10.24
2    4.6  3.1  1.5  0.2   None            4.6       None          0       9.61
3    5.0  3.6  1.4  0.2   None            5.0       None          0      12.96
4    5.4  3.9  1.7  0.4   None            5.4       None          0      15.21
..   ...  ...  ...  ...    ...            ...        ...        ...        ...
144  6.7  3.0  5.2  2.3   None            6.7       None          2       9.00
145  6.3  2.5  5.0  1.9   None            6.3       None          1       6.25
146  6.5  3.0  5.2  2.0   None            6.5       None          2       9.00
147  6.2  3.4  5.4  2.3   None            6.2       None          2      11.56
148  5.9  3.0  5.1  1.8   None            5.9       None          1       9.00

[149 rows x 9 columns]

#### Data Aggregating and Grouping

In [62]:
df = pd.read_csv("electic_vehicle_date.csv")
df.head()

,VIN (1-10),County,City,State,Postal Code,Model Year,Make,Model,Electric Vehicle Type,Clean Alternative Fuel Vehicle (CAFV) Eligibility,Electric Range,Legislative District,DOL Vehicle ID,Vehicle Location,Electric Utility,2020 Census Tract
0,5YJYGDEE8L,Thurston,Tumwater,WA,98501.0,2020,TESLA,MODEL Y,Battery Electric Vehicle (BEV),Clean Alternative Fuel Vehicle Eligible,291.0,35.0,124633715,POINT (-122.89165 47.03954),PUGET SOUND ENERGY INC,5.306701e+10
1,5YJXCAE2XJ,Snohomish,Bothell,WA,98021.0,2018,TESLA,MODEL X,Battery Electric Vehicle (BEV),Clean Alternative Fuel Vehicle Eligible,238.0,1.0,474826075,POINT (-122.18384 47.8031),PUGET SOUND ENERGY INC,5.306105e+10
2,5YJ3E1EBXK,King,Kent,WA,98031.0,2019,TESLA,MODEL 3,Battery Electric Vehicle (BEV),Clean Alternative Fuel Vehicle Eligible,220.0,47.0,280307233,POINT (-122.17743 47.41185),PUGET SOUND ENERGY INC||CITY OF TACOMA - (WA),5.303303e+10
3,7SAYGDEE4T,King,Issaquah,WA,98027.0,2026,TESLA,MODEL Y,Battery Electric Vehicle (BEV),Eligibility unknown as battery range has not b...,0.0,41.0,280786565,POINT (-122.03439 47.5301),PUGET SOUND ENERGY INC||CITY OF TACOMA - (WA),5.303302e+10
4,WAUUPBFF9G,King,Seattle,WA,98103.0,2016,AUDI,A3,Plug-in Hybrid Electric Vehicle (PHEV),Not eligible due to low battery range,16.0,43.0,198988891,POINT (-122.35436 47.67596),CITY OF SEATTLE - (WA)|CITY OF TACOMA - (WA),5.303300e+10

In [66]:
# We have to group by Makes and also mean of there range
grouped_mean = df.groupby('Make')['Electric Range'].mean()
print(grouped_mean)

Make
ACURA                       0.000000
ALFA ROMEO                 33.000000
AUDI                       36.319454
AZURE DYNAMICS             56.000000
BENTLEY                    32.375000
BMW                        27.638184
BRIGHTDROP                  0.000000
CADILLAC                    1.505351
CHEVROLET                  79.141709
CHRYSLER                   32.165636
DODGE                      27.664269
FIAT                       74.274533
FISKER                      2.436242
FORD                        7.183548
GENESIS                     0.000000
GMC                         0.000000
HONDA                      13.286850
HYUNDAI                    12.236556
JAGUAR                    178.100000
JEEP                       21.674446
KIA                        29.067186
LAMBORGHINI                27.882353
LAND ROVER                 49.570093
LEXUS                      22.874706
LINCOLN                    24.724942
LUCID                       0.000000
MASERATI                    0.000000
MAZDA                      25.580363
MERCEDES-BENZ              16.221360
MINI                       13.563697
MITSUBISHI                 32.579791
MULLEN AUTOMOTIVE INC.      0.000000
NISSAN                     64.576207
POLESTAR                   30.358793
PORSCHE                    49.699374
RAM                         0.000000
RIVIAN                      0.000000
ROLLS-ROYCE                 0.000000
SMART                      61.750000
SUBARU                      0.628405
TESLA                      53.120082
TH!NK                     100.000000
TOYOTA                     28.148580
VINFAST                     0.000000
VOLKSWAGEN                 15.189997
VOLVO                      17.728386
WHEEGO ELECTRIC CARS      100.000000
Name: Electric Range, dtype: float64

In [68]:
# If you have to do group by based on two categories.
grouped = df.groupby(['Make', 'Model'])['Electric Range'].sum()

print(grouped)

Make                  Model
ACURA                 ZDX           0.0
ALFA ROMEO            TONALE     3300.0
AUDI                  A3         8528.0
                      A6            0.0
                      A7 E        288.0
                                 ...
VOLVO                 V60        3913.0
                      XC40          0.0
                      XC60      53535.0
                      XC90      59384.0
WHEEGO ELECTRIC CARS  WHEEGO      200.0
Name: Electric Range, Length: 183, dtype: float64

In [79]:
df.describe()
df.head()

,VIN (1-10),County,City,State,Postal Code,Model Year,Make,Model,Electric Vehicle Type,Clean Alternative Fuel Vehicle (CAFV) Eligibility,Electric Range,Legislative District,DOL Vehicle ID,Vehicle Location,Electric Utility,2020 Census Tract
0,5YJYGDEE8L,Thurston,Tumwater,WA,98501.0,2020,TESLA,MODEL Y,Battery Electric Vehicle (BEV),Clean Alternative Fuel Vehicle Eligible,291.0,35.0,124633715,POINT (-122.89165 47.03954),PUGET SOUND ENERGY INC,5.306701e+10
1,5YJXCAE2XJ,Snohomish,Bothell,WA,98021.0,2018,TESLA,MODEL X,Battery Electric Vehicle (BEV),Clean Alternative Fuel Vehicle Eligible,238.0,1.0,474826075,POINT (-122.18384 47.8031),PUGET SOUND ENERGY INC,5.306105e+10
2,5YJ3E1EBXK,King,Kent,WA,98031.0,2019,TESLA,MODEL 3,Battery Electric Vehicle (BEV),Clean Alternative Fuel Vehicle Eligible,220.0,47.0,280307233,POINT (-122.17743 47.41185),PUGET SOUND ENERGY INC||CITY OF TACOMA - (WA),5.303303e+10
3,7SAYGDEE4T,King,Issaquah,WA,98027.0,2026,TESLA,MODEL Y,Battery Electric Vehicle (BEV),Eligibility unknown as battery range has not b...,0.0,41.0,280786565,POINT (-122.03439 47.5301),PUGET SOUND ENERGY INC||CITY OF TACOMA - (WA),5.303302e+10
4,WAUUPBFF9G,King,Seattle,WA,98103.0,2016,AUDI,A3,Plug-in Hybrid Electric Vehicle (PHEV),Not eligible due to low battery range,16.0,43.0,198988891,POINT (-122.35436 47.67596),CITY OF SEATTLE - (WA)|CITY OF TACOMA - (WA),5.303300e+10

In [87]:
# Multiple Aggregate Functions
df.groupby(['Make', 'Model'])['Electric Range'].agg(['mean','sum','count'])

                                   mean      sum  count
Make                 Model
ACURA                ZDX       0.000000      0.0    352
ALFA ROMEO           TONALE   33.000000   3300.0    100
AUDI                 A3       16.000000   8528.0    533
                     A6        0.000000      0.0     49
                     A7 E     24.000000    288.0     12
...                                 ...      ...    ...
VOLVO                V60      38.742574   3913.0    101
                     XC40      0.000000      0.0   1387
                     XC60     28.689711  53535.0   1866
                     XC90     25.674016  59384.0   2313
WHEEGO ELECTRIC CARS WHEEGO  100.000000    200.0      2

[183 rows x 3 columns]

#### Merging and Joining Dataframe

In [96]:
df1 = pd.DataFrame({'Key': ['A', 'B', 'C'], 'Value1' : [1,2,3]})
df2 = pd.DataFrame({'Key': ['A', 'B', 'C','D'], 'Value2' : [1,2,3,4]})

In [ ]:
df1

  Key  Value2
0   A       1
1   B       2
2   C       3

In [97]:
df2

  Key  Value2
0   A       1
1   B       2
2   C       3
3   D       4

In [100]:
# Merging two data frame on the key column.
pd.merge(df1,df2)
pd.merge(df1,df2,on='Key',how='inner') # Inner Join
pd.merge(df1,df2,on='Key',how='outer') # Outer Join
# Left outer join -> left
# Right outer join -> right
# Cross join -> cross6

  Key  Value1  Value2
0   A     1.0       1
1   B     2.0       2
2   C     3.0       3
3   D     NaN       4